Repository: KDE/killbots
Catalog: po/*/killbots.po
Languages: ar, it, pt_br

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
it: Valter Mura
pt_br: Mauricio Piacentini, André Marcelo Alvarenga

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
it: valtermura@gmail.com
pt_br: piacentini@kde.org, alvarenga@kde.org

# @label
source: Round:
ar: الجولة:
it: Turno:
pt_br: Turno:

# @label
source: Score:
ar: النتيجة:
it: Punteggio:
pt_br: Placar:

# @label
source: Enemies:
ar: الأعداء:
it: Avversari:
pt_br: Inimigos:

# @label
source: Energy:
ar: الطاقة:
it: Energia:
pt_br: Energia:

# @info
source: Round complete.
ar: انتهت الجولة.
it: Turno completato.
pt_br: Turno completo.

# @info
source: Board is full. Resetting enemy counts.
ar: اللوحة ممتلئة. سيصفّر عدد الأعداء.
it: Il tavoliere è completo. Cancellazione del conteggio nemici.
pt_br: O tabuleiro está cheio. Reiniciando a contagem de inimigos.

# @info
source: New game.
ar: لعبة جديدة
it: Nuova partita.
pt_br: Novo jogo.

# @info
source: Game over.
ar: اللعبة انتهت.
it: Partita terminata.
pt_br: Fim de jogo.

source: The action performed on a middle-click
ar: سينفذ هذا الإجراء بالنّقر على الزر الأوسط في الفأرة
it: Azione eseguita col tasto centrale del mouse
pt_br: Ação realizada com um clique no botão do meio do mouse

source: Selects the action performed when middle-clicking on the main game area. If a middle mouse button is not available, this action can be performed by left- and right-clicking simultaneously or by left-clicking while holding the control key.
ar: يحدد الإجراء الذي سينفذ عند النقر بزر الفأرة الأوسط على منطقة اللعبة الرئيسة. إذا لم يكن زر الفأرة الأوسط متاحًا؛ فيمكن تنفيذ هذا الإجراء بالنقر بزر الفأرة الأيسر والأيمن في نفس الوقت أو بالنقر بزر الفأرة الأيسر مع الاستمرار في الضغط على مفتاح التحكم.
it: Seleziona l'azione eseguita facendo clic col tasto centrale del mouse nell'area di gioco principale. Se non è disponibile un tasto centrale, quest'azione può essere eseguita premendo simultaneamente i tasti destro e sinistro, oppure il tasto sinistro mentre si tiene premuto il tasto Ctrl.
pt_br: Seleciona a ação realizada quando o botão do meio do mouse é clicado na área principal do jogo. Se um mouse com três botões não estiver disponível, esta ação pode ser realizada clicando-se simultaneamente com os dois botões do mouse, ou clicando-se com o botão esquerdo enquanto se segura a tecla CTRL.

source: The action performed on a right-click
ar: سينفذ هذا الإجراء بالنّقر على الزر الأيمن في الفأرة
it: Azione eseguita col tasto destro del mouse
pt_br: Ação realizada com um clique no botão esquerdo do mouse

source: Selects the action performed when right-clicking on the main game area.
ar: يحدد الإجراء الذي سينفذ عند النقر بزر الفأرة الأيمن على منطقة اللعبة الرئيسة.
it: Seleziona l'azione eseguita quando si fa clic col tasto destro del mouse nell'area di gioco principale.
pt_br: Seleciona a ação realizada quando se clica com o botão direito do mouse na área principal do jogo.

source: The speed used to display animations
ar: سرعة عرض التحريكات
it: Velocità usata per visualizzare le animazioni
pt_br: A velocidade usada para animações

source: Adjusts the speed at which the in game animations are displayed.
ar: اضبط سرعة عرض الرسوم المتحركة في اللعبة.
it: Regola la velocità di visualizzazione delle animazioni di gioco.
pt_br: Ajusta a velocidade na qual as animações do jogo são mostradas.

source: Prevent the player from making fatal moves
ar: امنع اللاعب من عمل حركات قاتلة
it: Impedisce che il giocatore esegua mosse fatali
pt_br: Impede o jogador de fazer movimentos fatais

source: If checked, the game will ignore any move that would result in the immediate death of the hero (other than random teleports and waiting out the round).
ar: إذا حدد هذا الخيار، فسوف تتجاهل اللعبة أي حركة من شأنها أن تؤدي إلى الموت الفوري للبطل (بخلاف عمليات النقل العشوائية والانتظار حتى انتهاء الجولة).
it: Se attivato, il gioco ignorerà qualsiasi mossa che possa causare la morte immediata dell'eroe (diversamente dai teletrasporti casuali e le attese fuori dal turno).
pt_br: Quando selecionado, o jogo vai ignorar qualquer movimento que resultaria na morte imediata do herói (sem contar teletransportes aleatórios e esperar o próximo turno).

source: The selected set of game rules
ar: مجموعة مختارة من قواعد اللعبة
it: Gruppo di regole di gioco selezionato
pt_br: Conjunto de regras do jogo selecionado

source: Selects the set of game rules to be used in the next game.
ar: تحديد مجموعة قواعد اللعبة التي ستستخدم في اللعبة التالية.
it: Seleziona il gruppo di regole di gioco da usare nella partita successiva.
pt_br: Seleciona o conjunto de regras a ser usado na próxima partida.

# @title:menu
source: Move
ar: انقل
it: Sposta
pt_br: Movimento

source: Main Toolbar
ar: شريط الأدوات الرئيسي
it: Barra degli strumenti principale
pt_br: Barra de ferramentas principal

source: Killbots
ar: معركة الآليّين

source: A KDE game of killer robots and teleportation.
ar: لعبة كيدي من الروبوتات القاتلة والانتقال الآني.
it: Un gioco KDE di robot killer e teletrasporto.
pt_br: Um jogo de robôs assassinos e teletransporte para o KDE.

source: © 2006-2009, Parker Coates
ar: © 2006-2009، باركر كوتس

source: Parker Coates
ar: باركر كوتس

source: Developer
ar: مطوّر
it: Sviluppatore
pt_br: Desenvolvedor

source: Author of Gnome Robots. Invented safe teleports, pushing junkheaps and fast robots.
ar: مؤلف كتاب Gnome Robots. اخترع أجهزة نقل آمنة، ونقل أكوام الحطام، والروبوتات السريعة.
it: Autore di Gnome Robots. Ha inventato il teletrasporto sicuro, rottami spostabili e robot veloci.
pt_br: Autor do Gnome Robots. Inventor dos teletransportes seguros, dos empurrões de montes de lixo e dos robôs rápidos.

source: This is the main game area used to interact with Killbots. It shows the current state of the game grid and allows one to control the hero using the mouse. It also displays certain statistics about the game in progress.
ar: هذه هي منطقة اللعبة الرئيسة المستخدمة للتفاعل مع معركة الآليّين. وهي تعرض الحالة الحالية لشبكة اللعبة وتتيح لك التحكم في البطل باستخدام الفأرة. كما تعرض إحصائيات معينة حول اللعبة الجارية.
it: Questa è l'area di gioco principale, usata per interagire con Killbots. Essa mostra lo stato attuale della griglia di gioco e permette all'utente di controllare l'eroe tramite il mouse. Mostra, inoltre, alcune statistiche di avanzamento del gioco.
pt_br: Está é a área principal de jogo usada para se interagir com Killbots. Ela mostra o estado atual do quadriculado do jogo e permite o controle do herói usando o mouse. Ela também mostra algumas estatísticas a respeito do jogo atual.

# @title
source: General
ar: عامّ
it: Generale
pt_br: Geral

# @info
source: Configure general settings
ar: ا&ضبط الخيارات العامّة
it: Impostazioni generali di configurazione
pt_br: Configurar opções gerais

# @title
source: Game Type
ar: نوع اللعبة
it: Tipo di gioco
pt_br: Tipo de jogo

# @info
source: Select a game type
ar: اختر نوع اللعبة
it: Seleziona un tipo di gioco
pt_br: Selecione um tipo de jogo

# @title
source: Appearance
ar: المظهر
it: Aspetto
pt_br: Aparência

# @info
source: Select a graphical theme
ar: اختر السمة الرسومية
it: Seleziona un tema grafico
pt_br: Selecione um tema gráfico

source: A new game type has been selected, but there is already a game in progress.
ar: حُدد نوع لعبة جديد، ولكن هناك لعبة تعمل حاليا.
it: È stato selezionato un nuovo tipo di gioco, ma una partita è ancora in svolgimento.
pt_br: Um novo conjunto de regras foi selecionado, mas já existe um jogo em progresso.

# @title:window
source: Game Type Changed
ar: غُير نوع اللعبة
it: Tipo di gioco modificato
pt_br: Tipo de jogo alterado

# @action:button
source: Continue Current Game
ar: واصل اللعبة الحالية
it: Continua la partita attuale
pt_br: Continuar o jogo atual

# @action:button
source: Start a New Game
ar: ابدأ لعبة جديدة
it: Inizia una nuova partita
pt_br: Iniciar um novo jogo

# @title:column round of the game
source: Round
ar: الجولة:
it: Turno
pt_br: Turno

# @action
source: Teleport Safely
ar: انقل آنيًا لمكان آمن
it: Teletrasporto sicuro
pt_br: Teletransporte seguro

# @info:tooltip
source: Teleport to a safe location
ar: انقل آنيًا إلى مكان آمن
it: Teletrasporto in un luogo sicuro
pt_br: Teletransportar para um lugar seguro

# @action
source: Teleport
ar: انقل آنيًا
it: Teletrasporto
pt_br: Teletransporte

# @info:tooltip
source: Teleport to a random location
ar: انقل آنيًا إلى مكان عشوائي
it: Teletrasporto in un luogo casuale
pt_br: Teletransportar para uma localização aleatória

# @action
source: Teleport (Safely if Possible)
ar: انقل آنيًا (لمكان آمن إذا أمكن)
it: Teletrasporto (sicuro, se possibile)
pt_br: Teletransporte (seguro se possível)

source: Space
ar: مسافة
it: Spazio
pt_br: Espaço

# @info:tooltip
source: Teleport safely if that action is enabled, otherwise teleport randomly
ar: انقل آنيًا لمكان آمن إذا كان الإجراء ممكن، وإلا انقل عشوائيا
it: Teletrasporta in modo sicuro se tale azione è abilitata, in caso contrario teletrasporta in modo casuale
pt_br: Teletransporte seguro, se essa ação estiver habilitada, caso contrário um teletransporte aleatório

# @action
source: Vaporizer
ar: مُبخر
it: Vaporizzatore
pt_br: Vaporizador

# @info:tooltip
source: Destroy all enemies in neighboring cells
ar: دمّر كل الأعداء في الخلايا المجاورة
it: Distruggi tutti i nemici nelle celle limitrofe
pt_br: Destruir todos os inimigos nas células vizinhas

# @action
source: Wait Out Round
ar: انتظر جولة
it: Aspetta fuori dal turno
pt_br: Esperar o turno

# @info:tooltip
source: Risk remaining in place until the end of the round for bonuses
ar: خاطر بالبقاء في المكان حتى نهاية الجولة للحصول على المكافآت
it: Rischia per il bonus restando nel posto fino alla fine del turno
pt_br: Risco de permanência no lugar até ao fim da rodada para os bônus

# @action
source: Move Up and Left
ar: حرّك للأعلى ولليسار
it: Sposta in alto a sinistra
pt_br: Mover para cima e para a esquerda

# @action
source: Move Up
ar: انقل لأعلى
it: Sposta in alto
pt_br: Mover para cima

# @action
source: Move Up and Right
ar: حرّك للأعلى ولليمين
it: Sposta in alto a destra
pt_br: Mover para cima e para a direita

# @action
source: Move Left
ar: حرك لليسار
it: Sposta a sinistra
pt_br: Mover para a esquerda

# @action
source: Stand Still
ar: قف ساكنًا
it: Stai fermo
pt_br: Ficar parado

# @action
source: Move Right
ar: حرك لليمين
it: Sposta a destra
pt_br: Mover para a direita

# @action
source: Move Down and Left
ar: حرّك للأسفل ولليسار
it: Sposta in basso a sinistra
pt_br: Mover para baixo e para a esquerda

# @action
source: Move Down
ar: انقل لأسفل
it: Sposta in basso
pt_br: Mover para baixo

# @action
source: Move Down and Right
ar: حرّك للأسفل ولليمين
it: Sposta in basso a destra
pt_br: Mover para baixo e para a direita

# @item:inlistbox No action on click
source: Nothing
ar: لا شيء
it: Nulla
pt_br: Nada

# @action
source: Step
ar: خطوة
it: Passaggio
pt_br: Passo

# @action
source: Repeated Step
ar: خطوات مكررة
it: Passaggio ripetuto
pt_br: Passo repetido

# @item:inrange
source: Slow
ar: بطيء
it: Lento
pt_br: Devagar

# @item:inrange
source: Fast
ar: سريع
it: Veloce
pt_br: Rápido

# @item:inrange
source: Instant
ar: فوري
it: Istantaneo
pt_br: Instantâneo

# @label:slider
source: Animation &speed:
ar: &سرعة التحريك:
it: &Velocità animazione:
pt_br: &Velocidade da animação:

# @option:check
source: Prevent &unsafe moves
ar: ا&منع الحركات غير الآمنة
it: Impedisci mosse &non sicure
pt_br: Impedir movimentos inseg&uros

# @label:listbox
source: &Middle-click action:
ar: إجراء النّقر بالو&سط: :
it: Azione tasto &centrale:
pt_br: Ação do botão do &meio:

# @label:listbox
source: &Right-click action:
ar: إجراء النقر بالي&مين:
it: Azione tasto &destro:
pt_br: Ação do botão da &direita:

source: Number of rows in game grid
ar: عدد الصفوف في شبكة اللعبة
it: Numero di righe nella griglia di gioco
pt_br: Número de linhas em um quadriculado de jogo

source: Number of columns in game grid
ar: عدد الأعمدة في شبكة اللعبة
it: Numero di colonne nella griglia di gioco
pt_br: Número de colunas em um quadriculado de jogo

source: Number of regular enemies in first round
ar: عدد الأعداء العاديين في الجولة الأولى
it: Numero di nemici regolari nel primo turno
pt_br: Número de inimigos regulares no primeiro turno

source: Number of regular enemies added in each new round
ar: عدد الأعداء العاديين المضافين في كل جولة جديدة
it: Numero di nemici regolari in ciascun nuovo turno
pt_br: Número de inimigos regulares adicionados a cada turno

source: Number of fast enemies in first round
ar: عدد الأعداء السريعين في الجولة الأولى
it: Numero di nemici veloci nel primo turno
pt_br: Número de inimigos rápidos no primeiro turno

source: Number of fast enemies added in each new round
ar: عدد الأعداء السريعين المضافين في كل جولة جديدة
it: Numero di nemici veloci aggiunti in ciascun nuovo turno
pt_br: Número de inimigos rápidos adicionados a cada turno

source: Fast enemies will skip their extra turn to avoid collisions with other robots
ar: سيتخطى الأعداء السريعون دورهم الإضافي لتجنب الاصطدام بالروبوتات الأخرى
it: I nemici veloci salteranno il loro turno aggiuntivo per evitare collisioni con gli altri robot
pt_br: Inimigos rápidos irão pular seus turnos extras para evitar colisões com outros robôs

source: Player can accumulate energy
ar: يمكن للاعب تجميع الطاقة
it: Il giocatore può accumulare energia
pt_br: O jogador pode acumular energia

source: Energy at start of first round
ar: الطاقة في بداية الجولة الأولى
it: Energia all'inizio del primo turno
pt_br: Energia no início do primeiro turno

source: Energy awarded for completing a round
ar: الطاقة الممنوحة لإكمال جولة
it: Energia guadagnata per il completamento di un turno
pt_br: Energy ganha ao completar um turno

source: Maximum energy cap in first round
ar: الحد الأقصى للطاقة في الجولة الأولى
it: Limite massimo di energia nel primo turno
pt_br: Teto máximo de energia na primeira rodada

source: Increase in maximum energy cap for each new round
ar: زيادة الحد الأقصى للطاقة لكل جولة جديدة
it: Incremento del limite massimo di energia per ciascun nuovo turno
pt_br: Aumento no teto máximo de energia para cada rodada nova

source: Player can perform safe teleports
ar: يمكن للاعب تنفيذ عمليات نقل آمنة
it: Il giocatore può eseguire teletrasporti sicuri
pt_br: O jogador pode efetuar teletransportes seguros

source: The cost of performing a safe teleport
ar: تكلفة إجراء عملية نقل آمنة
it: Costo per eseguire un teletrasporto sicuro
pt_br: O custo de se executar um teletransporte seguro

source: Player can use vaporizer
ar: يمكن للاعب استخدام مبخر
it: Il giocatore può usare il vaporizzatore
pt_br: O jogador pode usar vaporizador

source: Cost of using vaporizer
ar: تكلفة استخدام المبخر
it: Costo per l'uso del vaporizzatore
pt_br: O custo de usar o vaporizador

source: Number of junkheaps that can be pushed at once
ar: عدد أكوام الحطام التي يمكن دفعها مرة واحدة
it: Numero di rottami che possono essere spostati alla volta
pt_br: O número de montes de lixo que podem ser empurrados de uma vez

source: Player can destroy enemies with a pushed junkheap
ar: يمكن للاعب تدمير الأعداء باستخدام كومة الحطام مدفوعة
it: Il giocatore può distruggere i nemici con un rottame spostato
pt_br: O jogador pode destruir os inimigos ao empurrar um monte de lixo

source: Junkheaps placed on grid at start of first round
ar: وضع أكوام الحطام على الشبكة في بداية الجولة الأولى
it: Rottami posizionati sulla griglia all'inizio del primo turno
pt_br: Montes de lixo colocados na grelha no início da primeira rodada

source: Junkheaps added to the grid for each new round
ar: إضافة أكوام الحطام إلى الشبكة لكل جولة جديدة
it: Rottami aggiunti nella griglia per ciascun nuovo turno
pt_br: Montes de lixo adicionados à grelha para cada nova rodada

source: Points awarded for each regular enemy destroyed
ar: النقاط الممنوحة لكل عدو عادي مدمر
it: Punti assegnati per ciascun nemico regolare distrutto
pt_br: Pontos ganhos ao destruir um inimigo normal

source: Points awarded for each fast enemy destroyed
ar: النقاط الممنوحة لكل عدو سريع مدمر
it: Punti assegnati per ciascun nemico veloce distrutto
pt_br: Pontos ganhos para cada inimigo rápido destruído

source: Points awarded for each enemy destroyed while waiting out the round
ar: النقاط الممنوحة لكل عدو يدمر أثناء انتظار انتهاء الجولة
it: Punti assegnati per ciascun nemico distrutto durante l'attesa di fine turno
pt_br: Pontos ganhos ao destruir um inimigo ao esperar na rodada

source: Energy awarded for each enemy destroyed while waiting out the round
ar: الطاقة الممنوحة لكل عدو يدمر أثناء انتظار انتهاء الجولة
it: Energia assegnata per ciascun nemico distrutto durante l'attesa di fine turno
pt_br: Energia ganha ao destruir um inimigo ao esperar na rodada

source: Points awarded for each enemy destroyed with a pushed junkheap
ar: النقاط الممنوحة لكل عدو مدمر باستخدام كومة الحطام مدفوعة
it: Punti assegnati per ciascun nemico distrutto con un rottame spostato
pt_br: Pontos ganhos ao destruir um inimigo com um monte de lixo empurrado

source: Energy awarded for each enemy destroyed with a pushed junkheap
ar: الطاقة الممنوحة لكل عدو مدمر باستخدام كومة الحطام مدفوعة
it: Energia assegnata per ciascun nemico distrutto con un rottame spostato
pt_br: Energia ganha ao destruir um inimigo com um monte de lixo empurrado

source: Points awarded for each energy awarded above maximum energy cap
ar: النقاط الممنوحة لكل طاقة ممنوحة فوق الحد الأقصى للطاقة
it: Punti assegnati per l'energia assegnata oltre il limite massimo di energia
pt_br: Pontos ganhos por cada ganho de energia acima do teto máximo de energia

# @item Quantity of junkheaps that can be pushed
source: None
ar: بلا
it: Nessuno
pt_br: Nenhum

# @item Quantity of junkheaps that can be pushed
source: One
ar: واحد
it: Uno
pt_br: Um

# @item Quantity of junkheaps that can be pushed
source: Many
ar: عديدة
it: Molti
pt_br: Muitos

# @item
source: Yes
ar: نعم
it: Sì
pt_br: Sim

# @item
source: No
ar: لا
pt_br: Não

# @title:window
source: Details of %1 Game Type
ar: تفاصيل نوع اللعبة %1
it: Dettagli del tipo di gioco %1
pt_br: Detalhes do tipo de jogo %1

# @info:whatsthis
source: A list of the Killbots rulesets installed on this computer.
ar: قائمة بمجموعات قواعد لعبة قتال الآليّين المثبتة على هذا الحاسوب.
it: Elenco delle regole di Killbots installate in questo computer.
pt_br: Uma lista dos conjuntos de regras para Killbots instalados neste computador.

# title:group
source: Game Type Details
ar: تفاصيل نوع اللعبة
it: Dettagli del tipo di gioco
pt_br: Detalhes do tipo de jogo

# @info:whatsthis
source: Lists information on the currently selected game type.
ar: اعرض معلومات حول نوع اللعبة المختارة حاليا.
it: Elenca le informazioni sul tipo di gioco attualmente selezionato.
pt_br: Lista informação sobre o tipo de jogo atualmente selecionado.

# @label
source: Author:
ar: المؤلّف:
it: Autore:
pt_br: Autor:

# @label
source: Contact:
ar: الاتصال:
it: Contatto:
pt_br: Contato:

# @label
source: Description:
ar: الوصف:
it: Descrizione:
pt_br: Descrição:

# @action:button
source: Details…
ar: التفاصيل…

# @info:tooltip
source: Show the detailed parameters of the selected game type
ar: أظهر المعلمات التفصيلية لنوع اللعبة المحدد
it: Mostra i parametri dettagliati del tipo di gioco selezionato
pt_br: Exibe os parâmetros detalhados do tipo de jogo selecionado

# @info:whatsthisp
source: Opens a dialog listing the values of all internal parameters for the selected game type.
ar: يفتح مربع حوار يحتوي على قيم جميع المعلمات الداخلية لنوع اللعبة المحدد.
it: Apre una finestra che elenca i valori di tutti i parametri interni per il tipo di gioco selezionato.
pt_br: Abre um diálogo listando os valores de todos os parâmetros internos do tipo de jogo selecionado.

# @action:button
source: Details...
it: Dettagli...
pt_br: Detalhes...
